{
  "architectures": [
    "Fast_dLLM_Qwen3_5ForCausalLM"
  ],
  "auto_map": {
    "AutoConfig": "configuration.Fast_dLLM_Qwen3_5Config",
    "AutoModel": "modeling.Fast_dLLM_Qwen3_5Model",
    "AutoModelForCausalLM": "modeling.Fast_dLLM_Qwen3_5ForCausalLM"
  },
  "model_type": "Fast_dLLM_Qwen3_5",
  "source_model": "Qwen/Qwen3.5-9B",
  "source_architectures": [
    "Qwen3_5ForConditionalGeneration"
  ],
  "diffusion_bridge_status": "implemented",
  "gdn_mode": "option_a_causal_gdn_v0",
  "bd_size": 32,
  "mask_token": "|<MASK>|",
  "mask_token_id": 248077,
  "vocab_size": 248320,
  "hidden_size": 4096,
  "intermediate_size": 12288,
  "num_hidden_layers": 32,
  "num_attention_heads": 16,
  "num_key_value_heads": 4,
  "hidden_act": "silu",
  "max_position_embeddings": 262144,
  "initializer_range": 0.02,
  "rms_norm_eps": 1e-06,
  "use_cache": true,
  "tie_word_embeddings": false,
  "attention_bias": false,
  "attention_dropout": 0.0,
  "head_dim": 256,
  "linear_conv_kernel_dim": 4,
  "linear_key_head_dim": 128,
  "linear_value_head_dim": 128,
  "linear_num_key_heads": 16,
  "linear_num_value_heads": 32,
  "layer_types": [
    "linear_attention",
    "linear_attention",
    "linear_attention",
    "full_attention",
    "linear_attention",
    "linear_attention",
    "linear_attention",
    "full_attention",
    "linear_attention",
    "linear_attention",
    "linear_attention",
    "full_attention",
    "linear_attention",
    "linear_attention",
    "linear_attention",
    "full_attention",
    "linear_attention",
    "linear_attention",
    "linear_attention",
    "full_attention",
    "linear_attention",
    "linear_attention",
    "linear_attention",
    "full_attention",
    "linear_attention",
    "linear_attention",
    "linear_attention",
    "full_attention",
    "linear_attention",
    "linear_attention",
    "linear_attention",
    "full_attention"
  ],
  "rope_parameters": {
    "mrope_interleaved": true,
    "mrope_section": [
      11,
      11,
      10
    ],
    "rope_type": "default",
    "rope_theta": 10000000,
    "partial_rotary_factor": 0.25
  },
  "bos_token_id": null,
  "eos_token_id": 248044,
  "pad_token_id": 248044,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.53.1"
}
